In [5]:
import prettymetrics
import pandas as pd

In [6]:
from prettymetrics.supervised import LazyRegressor
from sklearn.model_selection import train_test_split

In [7]:
df = pd.read_csv('Salary_Data.csv')

In [8]:
df.head()

   YearsExperience   Salary
0             1.10 39343.00
1             1.30 46205.00
2             1.50 37731.00
3             2.00 43525.00
4             2.20 39891.00

In [9]:
df.isnull().sum()

YearsExperience    0
Salary             0
dtype: int64

In [10]:
df.Salary.unique()

array([ 39343.,  46205.,  37731.,  43525.,  39891.,  56642.,  60150.,
        54445.,  64445.,  57189.,  63218.,  55794.,  56957.,  57081.,
        61111.,  67938.,  66029.,  83088.,  81363.,  93940.,  91738.,
        98273., 101302., 113812., 109431., 105582., 116969., 112635.,
       122391., 121872.])

In [11]:
X = df.drop(['Salary'], axis = 1)
Y = df['Salary']

In [12]:
from sklearn.model_selection import train_test_split

X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size=0.15)

In [13]:
X_train

    YearsExperience
12             4.00
18             5.90
6              3.00
17             5.30
15             4.90
22             7.90
21             7.10
11             4.00
29            10.50
16             5.10
26             9.50
23             8.20
5              2.90
28            10.30
9              3.70
24             8.70
20             6.80
4              2.20
19             6.00
27             9.60
0              1.10
13             4.10
25             9.00
10             3.90
1              1.30